## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.terraform_managed_resource_09dffb3d0ed5812c62c6886c823fb0b1 will be created
  + resource "cloudflare_record" "terraform_managed_resource_09dffb3d0ed5812c62c6886c823fb0b1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pypi"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_179f0b68cd0e7f97a07175291846cc1f will be created
  + resource "cloudflare_record" "terraform_managed_resource_179f0b68cd0e7f97a07175291846cc1f" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "a"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_18809f26ceae1650b15bd34708cf5209 will be created
  + resource "cloudflare_record" "terraform_managed_resource_18809f26ceae1650b15bd34708cf5209" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "akatsuki.gg"
      + priority        = 5
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "alt1.aspmx.l.google.com"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_3d6cfd3fe505689a876871896cb5178c will be created
  + resource "cloudflare_record" "terraform_managed_resource_3d6cfd3fe505689a876871896cb5178c" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pypi2"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_4661649de0c6385b1bc5c4a10c33ba8f will be created
  + resource "cloudflare_record" "terraform_managed_resource_4661649de0c6385b1bc5c4a10c33ba8f" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "vault"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_49009678a2c31101a4b0484428c5ee9e will be created
  + resource "cloudflare_record" "terraform_managed_resource_49009678a2c31101a4b0484428c5ee9e" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "old"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_5f3fba0f5e45e88a9c153b6de0f2099e will be created
  + resource "cloudflare_record" "terraform_managed_resource_5f3fba0f5e45e88a9c153b6de0f2099e" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "k8s2"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_60590adccff06bef9cc8cd88cfcb7595 will be created
  + resource "cloudflare_record" "terraform_managed_resource_60590adccff06bef9cc8cd88cfcb7595" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "difficulty"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_607a671bcc399aee897f192ffbf904e2 will be created
  + resource "cloudflare_record" "terraform_managed_resource_607a671bcc399aee897f192ffbf904e2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "s"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_615173b6009fc0169a1d8471d781d8b1 will be created
  + resource "cloudflare_record" "terraform_managed_resource_615173b6009fc0169a1d8471d781d8b1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "vault2"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_660b7bf2540aeb1d28590e866876ca44 will be created
  + resource "cloudflare_record" "terraform_managed_resource_660b7bf2540aeb1d28590e866876ca44" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "reworks"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_6ee19f44bf87065363caee9d3c05a7a5 will be created
  + resource "cloudflare_record" "terraform_managed_resource_6ee19f44bf87065363caee9d3c05a7a5" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "b"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_7097f7485cca66490f13b70f7309453b will be created
  + resource "cloudflare_record" "terraform_managed_resource_7097f7485cca66490f13b70f7309453b" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "air_conditioning"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_716ef8ba0d0d3bf5ac99d7b86afa7477 will be created
  + resource "cloudflare_record" "terraform_managed_resource_716ef8ba0d0d3bf5ac99d7b86afa7477" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "c"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_94b09abead16cf373a0e864a6a405253 will be created
  + resource "cloudflare_record" "terraform_managed_resource_94b09abead16cf373a0e864a6a405253" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "assets"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_ac35937a3b1dd16002c34ff979c1c69c will be created
  + resource "cloudflare_record" "terraform_managed_resource_ac35937a3b1dd16002c34ff979c1c69c" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "relax"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_ae7787c943c44985f691ef77f11fdbb3 will be created
  + resource "cloudflare_record" "terraform_managed_resource_ae7787c943c44985f691ef77f11fdbb3" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "k8s"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_bbe86d4aacefd3b9e041971237326ad3 will be created
  + resource "cloudflare_record" "terraform_managed_resource_bbe86d4aacefd3b9e041971237326ad3" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "akatsuki.gg"
      + priority        = 10
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "alt4.aspmx.l.google.com"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_c777c536e462f6e23c88838db09ecc15 will be created
  + resource "cloudflare_record" "terraform_managed_resource_c777c536e462f6e23c88838db09ecc15" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "akatsuki.gg"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "68.183.196.157"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_cc99f7278220097b3f5762ec3d8a964c will be created
  + resource "cloudflare_record" "terraform_managed_resource_cc99f7278220097b3f5762ec3d8a964c" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "akatsuki.gg"
      + priority        = 1
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "aspmx.l.google.com"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_cddb658c1a211af6540fc615cae450ca will be created
  + resource "cloudflare_record" "terraform_managed_resource_cddb658c1a211af6540fc615cae450ca" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "akatsuki.gg"
      + priority        = 15
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "3h5azgn53tixa3a2yxyqkgyethll22hdjl7jj5jshsfw2wpalkhq.mx-verification.google.com"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_d37fc100eb9a8a0eec2f25281d95a7b1 will be created
  + resource "cloudflare_record" "terraform_managed_resource_d37fc100eb9a8a0eec2f25281d95a7b1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_e053bc92f9485f547e1bab88cd49f63e will be created
  + resource "cloudflare_record" "terraform_managed_resource_e053bc92f9485f547e1bab88cd49f63e" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "akatsuki.gg"
      + priority        = 10
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "alt3.aspmx.l.google.com"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_e0d1427279c9900c22b897d7b33efd9c will be created
  + resource "cloudflare_record" "terraform_managed_resource_e0d1427279c9900c22b897d7b33efd9c" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "payments"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_e3e21a2cfcf8d367fb84fffd12881f8d will be created
  + resource "cloudflare_record" "terraform_managed_resource_e3e21a2cfcf8d367fb84fffd12881f8d" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "rework"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_e5f9fa810f24478ec6212e2e5bd40542 will be created
  + resource "cloudflare_record" "terraform_managed_resource_e5f9fa810f24478ec6212e2e5bd40542" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "osu"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_ede7c6ea5f4e989e2f41010a704d8ccc will be created
  + resource "cloudflare_record" "terraform_managed_resource_ede7c6ea5f4e989e2f41010a704d8ccc" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "akatsuki.gg"
      + priority        = 5
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "alt2.aspmx.l.google.com"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_f8963f0589aab4febc666e249e3b18a3 will be created
  + resource "cloudflare_record" "terraform_managed_resource_f8963f0589aab4febc666e249e3b18a3" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "performance"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # cloudflare_record.terraform_managed_resource_fad0bd13cea5e0fb81469c735ecb612a will be created
  + resource "cloudflare_record" "terraform_managed_resource_fad0bd13cea5e0fb81469c735ecb612a" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "beatmaps"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "akatsuki.gg"
      + zone_id         = "18875b98b47e13a11f76f5795912453f"
    }

  # digitalocean_droplet.infrastructure01-droplet will be created
  + resource "digitalocean_droplet" "infrastructure01-droplet" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-23-10-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "infrastructure01.akatsuki.gg"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "tor1"
      + resize_disk          = true
      + size                 = "s-2vcpu-2gb"
      + status               = (known after apply)
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_droplet.k8s-master01-droplet will be created
  + resource "digitalocean_droplet" "k8s-master01-droplet" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "140878882"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "k8s-master01.akatsuki.gg"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "tor1"
      + resize_disk          = true
      + size                 = "s-2vcpu-2gb"
      + status               = (known after apply)
      + tags                 = [
          + "k8s-production",
        ]
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_droplet.k8s-worker01-droplet will be created
  + resource "digitalocean_droplet" "k8s-worker01-droplet" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "140878882"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "k8s-worker01.akatsuki.gg"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "tor1"
      + resize_disk          = true
      + size                 = "s-4vcpu-8gb-intel"
      + status               = (known after apply)
      + tags                 = [
          + "k8s-production",
        ]
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_droplet.k8s-worker02-droplet will be created
  + resource "digitalocean_droplet" "k8s-worker02-droplet" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-23-10-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "k8s-worker02.akatsuki.gg"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "tor1"
      + resize_disk          = true
      + size                 = "s-4vcpu-8gb-intel"
      + status               = (known after apply)
      + tags                 = [
          + "k8s-production",
        ]
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_droplet.k8s-worker04-droplet will be created
  + resource "digitalocean_droplet" "k8s-worker04-droplet" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-23-10-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "k8s-worker04.akatsuki.gg"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "tor1"
      + resize_disk          = true
      + size                 = "s-4vcpu-8gb-intel"
      + status               = (known after apply)
      + tags                 = [
          + "k8s-production",
        ]
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_droplet.mysql-master01-droplet will be created
  + resource "digitalocean_droplet" "mysql-master01-droplet" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-23-10-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "mysql-master01.akatsuki.gg"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "tor1"
      + resize_disk          = true
      + size                 = "s-4vcpu-8gb-intel"
      + status               = (known after apply)
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_droplet.rabbitmq-worker01-droplet will be created
  + resource "digitalocean_droplet" "rabbitmq-worker01-droplet" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-23-10-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "rabbitmq-worker01.akatsuki.gg"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "tor1"
      + resize_disk          = true
      + size                 = "s-1vcpu-2gb"
      + status               = (known after apply)
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_project.akatsuki-production will be created
  + resource "digitalocean_project" "akatsuki-production" {
      + created_at  = (known after apply)
      + environment = "Production"
      + id          = (known after apply)
      + is_default  = true
      + name        = "akatsuki-production"
      + owner_id    = (known after apply)
      + owner_uuid  = (known after apply)
      + purpose     = "Web Application"
      + resources   = (known after apply)
      + updated_at  = (known after apply)
    }

  # digitalocean_tag.k8s-production will be created
  + resource "digitalocean_tag" "k8s-production" {
      + databases_count        = (known after apply)
      + droplets_count         = (known after apply)
      + id                     = (known after apply)
      + images_count           = (known after apply)
      + name                   = "k8s-production"
      + total_resource_count   = (known after apply)
      + volume_snapshots_count = (known after apply)
      + volumes_count          = (known after apply)
    }

  # digitalocean_vpc.akatsuki-production-vpc will be created
  + resource "digitalocean_vpc" "akatsuki-production-vpc" {
      + created_at = (known after apply)
      + default    = (known after apply)
      + id         = (known after apply)
      + ip_range   = "10.118.0.0/20"
      + name       = "akatsuki-production"
      + region     = "tor1"
      + urn        = (known after apply)
    }

Plan: 39 to add, 0 to change, 0 to destroy.
```
</details>